Revit 2024 API
CableTraySizeIterator Class
 An iterator to a set of MEP cable tray sizes from CableTraySizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class CableTraySizeIterator : IEnumerator<MEPSize>
Visual Basic
Public Class CableTraySizeIterator _
	Implements IEnumerator(Of MEPSize)
Visual C++
public ref class CableTraySizeIterator : IEnumerator<MEPSize^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.CableTraySizeIterator
See Also
CableTraySizeIterator Members
Autodesk.Revit.DB.Electrical Namespace